# Простые типы
#       None                неопределенное значение переменной
#       bool                Булевый тип: True/False
#       int                 Целочисленный тип
#       float               Вещественный тип
#       complex             Комплексный тип (для комплексных чисел)
#       str                 Строковый тип
#
# Бинарные списки
#       bytes               Список байт
#       bytearray           Байтовые массивы
#       memoryview          Специальные объекты для доступа к внутренним данным объекта через protocol buffer
#
# Множества
#
#        set                 Множество
#        frozenset           Неизменяемое множество
#
# Словари
#        dict                Словарь

a = 3 // 2 # Деление с округлением к наименьшему целому.
a = -3 // 2 # -2
print(a)

